УТ_для_edt/src/Catalogs/CRM_ДействияТриггеров/CRM_ДействияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ДействияТриггеров</name>
  <predefined>
    <items>
      <name>СоздатьВзаимодействие</name>
      <description>Запланировать взаимодействие</description>
    </items>
    <items>
      <name>ПересчетПотенциалаВИнтересе</name>
      <description>Заполнить  поле &quot;Ожидаемая  выручка&quot; </description>
    </items>
    <items>
      <name>ОтказЗаписи</name>
      <description>Запретить запись</description>
    </items>
    <items>
      <name>ЗапретитьРедактированиеДокументаКоммерческоеПредложение</name>
      <description>Запретить редактирование документа Коммерческое предложение</description>
    </items>
    <items>
      <name>СтартПроизвольногоБП</name>
      <description>Запустить бизнес-процесс</description>
    </items>
    <items>
      <name>ИзменениеСостоянияИнтереса</name>
      <description>Изменить состояние интереса</description>
    </items>
    <items>
      <name>ИзменитьТемуИнтереса</name>
      <description>Изменить тему интереса</description>
    </items>
    <items>
      <name>ОповещениеПочта</name>
      <description>Отправить E-mail</description>
    </items>
    <items>
      <name>ОповещениеСМС</name>
      <description>Отправить SMS</description>
    </items>
    <items>
      <name>CRM_Модуль_ПривязкаЗаказовКИнтересам</name>
      <description>Привязка заказов к интересам</description>
    </items>
    <items>
      <name>ПроверитьНаличиеДокументов</name>
      <description>Проверить наличие документов</description>
    </items>
    <items>
      <name>РассылкаПоСегменту</name>
      <description>Рассылка электронных писем  клиентам в сегменте</description>
    </items>
    <items>
      <name>СозданиеЗаявкиНаОснованииПисьма</name>
      <description>Создание заявки(лида) на основании письма</description>
    </items>
    <items>
      <name>ЗаявкаССайта</name>
      <description>Создание интереса клиента (лида) на основание письма-заявки</description>
    </items>
    <items>
      <name>СоздатьЗадачуПоОбъекту</name>
      <description>Создать задачу</description>
    </items>
    <items>
      <name>ОповещениеНапоминание</name>
      <description>Создать напоминание</description>
    </items>
    <items>
      <name>ГенерацияИнтересаПоИнтересу</name>
      <description>Генерация интереса по интересу</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТипов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ДействияТриггеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Создает предопределенные действия.
//
// Параметры:
//	Параметры - Структура - параметры выполнения.
//
Процедура СоздатьПредопределенныеДействия(Параметры = Неопределено) Экспорт
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеПочта.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"CRM_","CRM_Модуль_")+"ТриггерПочтовойРассылки"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерПочтовойРассылки";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеСМС.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСМСРассылки"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерСМСРассылки";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 7;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеНапоминание.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерНапоминание"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерНапоминание";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 6;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗапретитьРедактированиеДокументаКоммерческоеПредложение.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ЗапретитьРедактированиеКП"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ЗапретитьРедактированиеКП";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.РассылкаПоСегменту.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерРассылкаПоСегменту"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерРассылкаПоСегменту";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗаявкаССайта.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗаявкаССайта"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерЗаявкаССайта";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СтартПроизвольногоБП.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗапускаБизнесПроцесса"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерЗапускаБизнесПроцесса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СозданиеЗаявкиНаОснованииПисьма.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерЗаявкаПоПисьму"));
	ОбработкаТриггера.НазваниеОбработки = "CRM_ТриггерЗаявкаПоПисьму";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОтказЗаписи.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерОтказЗаписи"));
	ОбработкаТриггера.НазваниеОбработки = "ОтказЗаписи";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ИзменениеСостоянияИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерИзменениеСостоянияИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ИзменениеСостоянияИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьЗадачуПоОбъекту.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьЗадачуПоОбъекту"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьЗадачуПоОбъекту";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьВзаимодействие.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьВзаимодействие"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьВзаимодействие";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 18;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ПересчетПотенциалаВИнтересе.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"CRM_ТриггерПересчетПотенциалаВИнтересе"));
	ОбработкаТриггера.НазваниеОбработки = "ПересчетПотенциалаВИнтересе";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ПроверитьНаличиеДокументов.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет("CRM_ТриггерПроверитьНаличиеДокументов"));
	ОбработкаТриггера.НазваниеОбработки = "ПроверитьНаличиеДокументов";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ИзменитьТемуИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет("CRM_ТриггерИзменитьТемуИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ИзменитьТемуИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ГенерацияИнтересаПоИнтересу.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет("CRM_ГенерацияИнтересаПоИнтересу"));
	ОбработкаТриггера.НазваниеОбработки = "ГенерацияИнтересаПоИнтересу";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ОбработкаТриггера = Справочники.CRM_ДействияТриггеров["CRM_Модуль_ПривязкаЗаказовКИнтересам"].ПолучитьОбъект();
		ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники["CRM_ДействияТриггеров"].ПолучитьМакет("CRM_Модуль_ПривязкаЗаказовКИнтересам"));
		ОбработкаТриггера.НазваниеОбработки = "ПривязкаЗаказовКИнтересам";
		ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
		ОбработкаТриггера.ИндексЦвета = 1;
		ОбработкаТриггера.Записать();
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - Переопределяет действия триггеров.
//
Процедура НовыеПредопределенныеДействияТриггеров() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДействияТриггеров.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ДействияТриггеров КАК CRM_ДействияТриггеров
	                      |ГДЕ
	                      |	НЕ CRM_ДействияТриггеров.Предопределенный");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДействиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ДействиеОбъект.ИндексЦвета = 10;
			ДействиеОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеПочта.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеСМС.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 7;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОповещениеНапоминание.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 6;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗапретитьРедактированиеДокументаКоммерческоеПредложение.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.РассылкаПоСегменту.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 3;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ЗаявкаССайта.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СтартПроизвольногоБП.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СозданиеЗаявкиНаОснованииПисьма.ПолучитьОбъект();
	ОбработкаТриггера.ИндексЦвета = 2;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ОтказЗаписи.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерОтказЗаписи"));
	ОбработкаТриггера.НазваниеОбработки = "ОтказЗаписи";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 1;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ИзменениеСостоянияИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерИзменениеСостоянияИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ИзменениеСостоянияИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьЗадачуПоОбъекту.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьЗадачуПоОбъекту"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьЗадачуПоОбъекту";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 4;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.СоздатьВзаимодействие.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(Справочники.CRM_ДействияТриггеров.ПолучитьМакет("CRM_ТриггерСоздатьВзаимодействие"));
	ОбработкаТриггера.НазваниеОбработки = "СоздатьВзаимодействие";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 18;
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_ДействияТриггеров.ПересчетПотенциалаВИнтересе.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаДействия = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"CRM_ТриггерПересчетПотенциалаВИнтересе"));
	ОбработкаТриггера.НазваниеОбработки = "ПересчетПотенциалаВИнтересе";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.ИндексЦвета = 9;
	ОбработкаТриггера.Записать();
	
КонецПроцедуры

// Функция - Возвращает массив исключаемых по ункциональным опциям предопределенных элементов справочника. 
// 
// Возвращаемое значение:
//  МассивИсключаемых -  Массив элементов справочника
//
Функция МассивИсключаемыхПоФОПредопределенных() Экспорт
	
	МассивИсключаемых = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("CRM_ИспользоватьБизнесПроцессы") ИЛИ CRM_ЛицензированиеЭкспортныеМетоды.ВариантПоставкиСТАРТ() Тогда
		МассивИсключаемых.Добавить(СтартПроизвольногоБП);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("CRM_ИспользоватьЗаявки") Тогда
		МассивИсключаемых.Добавить(СозданиеЗаявкиНаОснованииПисьма);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКоммерческиеПредложенияКлиентам") Тогда
		МассивИсключаемых.Добавить(ЗапретитьРедактированиеДокументаКоммерческоеПредложение);
	КонецЕсли;
	
	Возврат МассивИсключаемых;
	
КонецФункции

#КонецОбласти

#КонецЕсли
